html/geekbang-recommender-system.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>极客时间|推荐系统36式 文章目录</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">极客时间|推荐系统36式 文章目录</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7ee679b">开篇词 | 用知识去对抗技术不平等</a></li>
<li><a href="#orgfe62932">【概念篇】你真的需要个性化推荐系统吗?</a></li>
<li><a href="#org9119a39">【概念篇】个性化推荐系统那些绕不开的经典问题</a></li>
<li><a href="#orgb707240">【概念篇】这些你必须应该具备的思维模式</a></li>
<li><a href="#org9dde2f0">【内容推荐】画鬼容易画人难：用户画像的“能”和“不能”</a></li>
<li><a href="#org30f5151">【内容推荐】从文本到用户画像有多远</a></li>
<li><a href="#org397300b">【内容推荐】超越标签的内容推荐系统</a></li>
<li><a href="#org8e19d7c">【近邻推荐】人以群分，你是什么人就看到什么世界</a></li>
<li><a href="#org399d194">【近邻推荐】解密“看了又看”和“买了又买”</a></li>
<li><a href="#orgbbffad0">【近邻推荐】协同过滤中的相似度计算方法有哪些</a></li>
<li><a href="#org3a0a6c8">【矩阵分解】那些在Netflix Prize中大放异彩的推荐算法</a></li>
<li><a href="#orgcbc6f08">【矩阵分解】Facebook是怎么为十亿人互相推荐好友的</a></li>
<li><a href="#orgd927ab8">【矩阵分解】如果关注排序效果，那么这个模型可以帮到你</a></li>
<li><a href="#org772881c">【模型融合】经典模型融合办法：线性模型和树模型的组合拳</a></li>
<li><a href="#org79d202c">【模型融合】一网打尽协同过滤、矩阵分解和线性模型</a></li>
<li><a href="#org20c5b98">【模型融合】深度和宽度兼具的融合模型 Wide and Deep</a></li>
<li><a href="#orge2c6f97">【MAB问题】简单却有效的Bandit算法</a></li>
<li><a href="#orgf36babb">【MAB问题】结合上下文信息的Bandit算法</a></li>
<li><a href="#org1ccc9a5">【MAB问题】如何将Bandit算法与协同过滤结合使用</a></li>
<li><a href="#orgce291be">【深度学习】深度学习在推荐系统中的应用有哪些?</a></li>
<li><a href="#org70cbc4a">【深度学习】用RNN构建个性化音乐播单</a></li>
<li><a href="#org7dd5992">【其他应用算法】构建一个科学的排行榜体系</a></li>
<li><a href="#org2ee95ba">【其他应用算法】实用的加权采样算法</a></li>
<li><a href="#org99ca3da">【其他应用算法】推荐候选池的去重策略</a></li>
<li><a href="#orgd7db9f9">【常见架构】典型的信息流架构是什么样的</a></li>
<li><a href="#org091af03">【常见架构】Netflix个性化推荐架构</a></li>
<li><a href="#org725ed21">【常见架构】总览推荐架构和搜索、广告的关系</a></li>
<li><a href="#orge0a0b30">【关键模块】巧妇难为无米之炊：数据采集关键要素</a></li>
<li><a href="#org18d707b">【关键模块】让你的推荐系统反应更快：实时推荐</a></li>
<li><a href="#org0cf2327">【关键模块】让数据驱动落地，你需要一个实验平台</a></li>
<li><a href="#org481c2d8">【关键模块】 推荐系统服务化、存储选型及API设计</a></li>
<li><a href="#orgc681d79">【效果保证】推荐系统的测试方法及常用指标介绍</a></li>
<li><a href="#org2cf4b8a">【效果保证】道高一尺魔高一丈：推荐系统的攻防</a></li>
<li><a href="#org1cf0827">【开源工具】和推荐系统有关的开源工具及框架介绍</a></li>
<li><a href="#org095ea58">【产品篇】推荐系统在互联网产品商业链条中的地位</a></li>
<li><a href="#org4a28b8e">【产品篇】说说信息流的前世今生</a></li>
<li><a href="#org4830e0b">【团队篇】组建推荐团队及工程师的学习路径</a></li>
<li><a href="#orgd0722ea">推荐系统的参考阅读</a></li>
<li><a href="#orgfdbaa86">【尾声】遇“荐”之后，江湖再见</a></li>
</ul>
</div>
</div>


<div id="outline-container-org7ee679b" class="outline-2">
<h2 id="org7ee679b"><a href="https://time.geekbang.org/column/article/3599">开篇词 | 用知识去对抗技术不平等</a></h2>
<div class="outline-text-2" id="text-org7ee679b">
<p>
推荐系统的技术实践中，大厂们一骑绝尘，然而更普遍的是：太多中小厂、工程师们还不知道一个推荐系统如何才能从&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgfe62932" class="outline-2">
<h2 id="orgfe62932"><a href="https://time.geekbang.org/column/article/4318">【概念篇】你真的需要个性化推荐系统吗?</a></h2>
<div class="outline-text-2" id="text-orgfe62932">
<p>
在问“该怎么做”之前，先来回答一下“要不要做”，我先帮你更加透彻地理解“推荐系统”这个概念，只有彻底理解&#x2026;
</p>
</div>
</div>


<div id="outline-container-org9119a39" class="outline-2">
<h2 id="org9119a39"><a href="https://time.geekbang.org/column/article/4340">【概念篇】个性化推荐系统那些绕不开的经典问题</a></h2>
<div class="outline-text-2" id="text-org9119a39">
<p>
推荐系统发展到了今天，已经出现了一些常见的问题，一部分已经有很好的解决方案，另外一部分却还没有通用解决方&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgb707240" class="outline-2">
<h2 id="orgb707240"><a href="https://time.geekbang.org/column/article/4417">【概念篇】这些你必须应该具备的思维模式</a></h2>
<div class="outline-text-2" id="text-orgb707240">
<p>
我主要带你认识两方面的内容：一个是重新认识推荐系统关键元素的重要性，另一个是要建立起两个思维模式。
</p>
</div>
</div>


<div id="outline-container-org9dde2f0" class="outline-2">
<h2 id="org9dde2f0"><a href="https://time.geekbang.org/column/article/4574">【内容推荐】画鬼容易画人难：用户画像的“能”和“不能”</a></h2>
<div class="outline-text-2" id="text-org9dde2f0">
<p>
用户画像比较抽象，就像每个人都听说过鬼，但很少有人见过。事实上，它也没有那么神秘，只是大家对它有误解，要&#x2026;
</p>
</div>
</div>


<div id="outline-container-org30f5151" class="outline-2">
<h2 id="org30f5151"><a href="https://time.geekbang.org/column/article/4635">【内容推荐】从文本到用户画像有多远</a></h2>
<div class="outline-text-2" id="text-org30f5151">
<p>
对于一个早期的推荐系统来说，基于内容推荐离不开为用户构建一个初级的画像，从大量文本数据中挖掘用户画像会常&#x2026;
</p>
</div>
</div>


<div id="outline-container-org397300b" class="outline-2">
<h2 id="org397300b"><a href="https://time.geekbang.org/column/article/4674">【内容推荐】超越标签的内容推荐系统</a></h2>
<div class="outline-text-2" id="text-org397300b">
<p>
所谓的基于内容推荐，通俗一点来讲，就是一个包装成推荐系统的信息检索系统。这听上去有点残酷，但通常一个复杂&#x2026;
</p>
</div>
</div>


<div id="outline-container-org8e19d7c" class="outline-2">
<h2 id="org8e19d7c"><a href="https://time.geekbang.org/column/article/4802">【近邻推荐】人以群分，你是什么人就看到什么世界</a></h2>
<div class="outline-text-2" id="text-org8e19d7c">
<p>
把用户按照兴趣口味聚类成不同的群体，给用户产生的推荐就来自这个群体的平均值；所以要做好这个推荐，关键是如&#x2026;
</p>
</div>
</div>


<div id="outline-container-org399d194" class="outline-2">
<h2 id="org399d194"><a href="https://time.geekbang.org/column/article/4856">【近邻推荐】解密“看了又看”和“买了又买”</a></h2>
<div class="outline-text-2" id="text-org399d194">
<p>
如果做推荐系统不知道“基于物品的协同过滤”，那等同于做程序员不懂得冒泡排序。这个朴素的算法，就像是乔峰大&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgbbffad0" class="outline-2">
<h2 id="orgbbffad0"><a href="https://time.geekbang.org/column/article/4859">【近邻推荐】协同过滤中的相似度计算方法有哪些</a></h2>
<div class="outline-text-2" id="text-orgbbffad0">
<p>
推荐系统中，推荐算法分为两个门派，一个是机器学习派，另一个就是相似度门派。机器学习派是后起之秀，而相似度&#x2026;
</p>
</div>
</div>


<div id="outline-container-org3a0a6c8" class="outline-2">
<h2 id="org3a0a6c8"><a href="https://time.geekbang.org/column/article/5030">【矩阵分解】那些在Netflix Prize中大放异彩的推荐算法</a></h2>
<div class="outline-text-2" id="text-org3a0a6c8">
<p>
评分预测问题之所以虽然小众却十分重要，这一点得益于十多年前 Netflix Prize 的那一百万美元的悬赏效应。
</p>
</div>
</div>


<div id="outline-container-orgcbc6f08" class="outline-2">
<h2 id="orgcbc6f08"><a href="https://time.geekbang.org/column/article/5033">【矩阵分解】Facebook是怎么为十亿人互相推荐好友的</a></h2>
<div class="outline-text-2" id="text-orgcbc6f08">
<p>
在实际应用中，交替最小二乘更常用一些，这也是社交巨头 Facebook 在他们的推荐系统中选择的主要矩阵分解方法&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgd927ab8" class="outline-2">
<h2 id="orgd927ab8"><a href="https://time.geekbang.org/column/article/5055">【矩阵分解】如果关注排序效果，那么这个模型可以帮到你</a></h2>
<div class="outline-text-2" id="text-orgd927ab8">
<p>
矩阵分解在推荐系统中的地位非常崇高，恐怕本专栏介绍的其他算法模型都不能轻易地撼动它。它既有协同过滤的血统&#x2026;
</p>
</div>
</div>


<div id="outline-container-org772881c" class="outline-2">
<h2 id="org772881c"><a href="https://time.geekbang.org/column/article/5365">【模型融合】经典模型融合办法：线性模型和树模型的组合拳</a></h2>
<div class="outline-text-2" id="text-org772881c">
<p>
挖掘的工作就是对用户和物品做非常深入的结构化分析，庖丁解牛一样，各个角度各个层面的特征都被呈现出来，并且&#x2026;
</p>
</div>
</div>


<div id="outline-container-org79d202c" class="outline-2">
<h2 id="org79d202c"><a href="https://time.geekbang.org/column/article/5387">【模型融合】一网打尽协同过滤、矩阵分解和线性模型</a></h2>
<div class="outline-text-2" id="text-org79d202c">
<p>
因子分解机最早提出在 2010 年，在一些数据挖掘比赛中都取得了很好的成绩，后来被引入工业界做模型融合，也表&#x2026;
</p>
</div>
</div>


<div id="outline-container-org20c5b98" class="outline-2">
<h2 id="org20c5b98"><a href="https://time.geekbang.org/column/article/5406">【模型融合】深度和宽度兼具的融合模型 Wide and Deep</a></h2>
<div class="outline-text-2" id="text-org20c5b98">
<p>
将传统的“宽模型”和新的“深模型”结合，虽然更多的是一种工程上的创新，但是非常有实用性，模型也容易很理解&#x2026;
</p>
</div>
</div>


<div id="outline-container-orge2c6f97" class="outline-2">
<h2 id="orge2c6f97"><a href="https://time.geekbang.org/column/article/5594">【MAB问题】简单却有效的Bandit算法</a></h2>
<div class="outline-text-2" id="text-orge2c6f97">
<p>
Bandit 算法把每个用户看成一个多变的环境，待推荐的物品就如同赌场里老虎机的摇臂，如果推荐了符合用户心目中&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgf36babb" class="outline-2">
<h2 id="orgf36babb"><a href="https://time.geekbang.org/column/article/5607">【MAB问题】结合上下文信息的Bandit算法</a></h2>
<div class="outline-text-2" id="text-orgf36babb">
<p>
Bandit 算法用的是一种“走一步看一步”的思路，这一点看上去非常佛系，似乎一点都不如机器学习深度学习那样厚&#x2026;
</p>
</div>
</div>


<div id="outline-container-org1ccc9a5" class="outline-2">
<h2 id="org1ccc9a5"><a href="https://time.geekbang.org/column/article/5610">【MAB问题】如何将Bandit算法与协同过滤结合使用</a></h2>
<div class="outline-text-2" id="text-org1ccc9a5">
<p>
整个专栏的 Bandit 算法系列，主要是解决推荐系统中的冷启动和 EE 问题。Bandit 算法是公认的一种比较好的&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgce291be" class="outline-2">
<h2 id="orgce291be"><a href="https://time.geekbang.org/column/article/5843">【深度学习】深度学习在推荐系统中的应用有哪些?</a></h2>
<div class="outline-text-2" id="text-orgce291be">
<p>
经过这些年学界和业界的不断尝试，深度学习在推荐系统中已经有了很多成功的应用。那么，到底深度学习在推荐系统&#x2026;
</p>
</div>
</div>


<div id="outline-container-org70cbc4a" class="outline-2">
<h2 id="org70cbc4a"><a href="https://time.geekbang.org/column/article/5916">【深度学习】用RNN构建个性化音乐播单</a></h2>
<div class="outline-text-2" id="text-org70cbc4a">
<p>
在深度学习大火之后，对时间序列建模被提上议事日程，业界有很多尝试，今天以Spotify的音乐推荐为例，介绍循环&#x2026;
</p>
</div>
</div>


<div id="outline-container-org7dd5992" class="outline-2">
<h2 id="org7dd5992"><a href="https://time.geekbang.org/column/article/5933">【其他应用算法】构建一个科学的排行榜体系</a></h2>
<div class="outline-text-2" id="text-org7dd5992">
<p>
一个新用户来了，什么数据都还没有，推荐系统对其一无所知。这时候，你就需要一个排行榜了。
</p>
</div>
</div>


<div id="outline-container-org2ee95ba" class="outline-2">
<h2 id="org2ee95ba"><a href="https://time.geekbang.org/column/article/6177">【其他应用算法】实用的加权采样算法</a></h2>
<div class="outline-text-2" id="text-org2ee95ba">
<p>
今天介绍的算法非常简单，但是在推荐系统中有很多的用途。尤其是面对的数据需要采样、需要有所变化时，加权采样&#x2026;
</p>
</div>
</div>


<div id="outline-container-org99ca3da" class="outline-2">
<h2 id="org99ca3da"><a href="https://time.geekbang.org/column/article/6186">【其他应用算法】推荐候选池的去重策略</a></h2>
<div class="outline-text-2" id="text-org99ca3da">
<p>
推荐系统中，虽然我们十分关心推荐匹配的效果，但是别忘了，对原始内容的挖掘和清洗往往更加重要。这其中就包括&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgd7db9f9" class="outline-2">
<h2 id="orgd7db9f9"><a href="https://time.geekbang.org/column/article/6195">【常见架构】典型的信息流架构是什么样的</a></h2>
<div class="outline-text-2" id="text-orgd7db9f9">
<p>
从今天起，我们不再单独介绍推荐算法的原理，而是开始进入一个新的模块——工程篇。
</p>
</div>
</div>


<div id="outline-container-org091af03" class="outline-2">
<h2 id="org091af03"><a href="https://time.geekbang.org/column/article/6495">【常见架构】Netflix个性化推荐架构</a></h2>
<div class="outline-text-2" id="text-org091af03">
<p>
实际上，工程实现才是推荐系统的骨架，如果没有很好的软件实现，算法不能落地产生效果，更不能让推荐系统往更好&#x2026;
</p>
</div>
</div>


<div id="outline-container-org725ed21" class="outline-2">
<h2 id="org725ed21"><a href="https://time.geekbang.org/column/article/6499">【常见架构】总览推荐架构和搜索、广告的关系</a></h2>
<div class="outline-text-2" id="text-org725ed21">
<p>
今天我们提到了推荐架构和搜索、广告的关系，并将三者分别作了对比。这三者有统一的可能性，而且不低。如果要统&#x2026;
</p>
</div>
</div>


<div id="outline-container-orge0a0b30" class="outline-2">
<h2 id="orge0a0b30"><a href="https://time.geekbang.org/column/article/6506">【关键模块】巧妇难为无米之炊：数据采集关键要素</a></h2>
<div class="outline-text-2" id="text-orge0a0b30">
<p>
采集数据需要首先梳理好自己的数据有哪些，本文不是帮你梳理你的自己的产品中有哪些数据，而是告诉你看推荐系统&#x2026;
</p>
</div>
</div>


<div id="outline-container-org18d707b" class="outline-2">
<h2 id="org18d707b"><a href="https://time.geekbang.org/column/article/6630">【关键模块】让你的推荐系统反应更快：实时推荐</a></h2>
<div class="outline-text-2" id="text-org18d707b">
<p>
实时推荐有三个层次，很多非工程师的朋友们常常脑海里想象的实时推荐实际上只是第二层次，也就是实时更新特征，&#x2026;
</p>
</div>
</div>


<div id="outline-container-org0cf2327" class="outline-2">
<h2 id="org0cf2327"><a href="https://time.geekbang.org/column/article/6799">【关键模块】让数据驱动落地，你需要一个实验平台</a></h2>
<div class="outline-text-2" id="text-org0cf2327">
<p>
实验平台是推荐系统要做到数据驱动必不可少的东西，但是如何做到科学高效快速地做实验呢？
</p>
</div>
</div>


<div id="outline-container-org481c2d8" class="outline-2">
<h2 id="org481c2d8"><a href="https://time.geekbang.org/column/article/6803">【关键模块】 推荐系统服务化、存储选型及API设计</a></h2>
<div class="outline-text-2" id="text-org481c2d8">
<p>
对于认识一个推荐系统来说，还差最后一个问题需要解决，那就是：万事俱备，如何给用户提供一个真正的在线推荐服&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgc681d79" class="outline-2">
<h2 id="orgc681d79"><a href="https://time.geekbang.org/column/article/7181">【效果保证】推荐系统的测试方法及常用指标介绍</a></h2>
<div class="outline-text-2" id="text-orgc681d79">
<p>
面对推荐系统这样一个有诸多复杂因素联动起作用的系统，要时时刻刻知道它好不好，健不健康，你同样需要掌握一些&#x2026;
</p>
</div>
</div>


<div id="outline-container-org2cf4b8a" class="outline-2">
<h2 id="org2cf4b8a"><a href="https://time.geekbang.org/column/article/7188">【效果保证】道高一尺魔高一丈：推荐系统的攻防</a></h2>
<div class="outline-text-2" id="text-org2cf4b8a">
<p>
推荐系统也是一种软件，只要是软件，就一定有安全问题，推荐系统也不能免俗。
</p>
</div>
</div>


<div id="outline-container-org1cf0827" class="outline-2">
<h2 id="org1cf0827"><a href="https://time.geekbang.org/column/article/7204">【开源工具】和推荐系统有关的开源工具及框架介绍</a></h2>
<div class="outline-text-2" id="text-org1cf0827">
<p>
有别于介绍一个笼统的“推荐系统”，我更倾向于把粒度和焦点再缩小一下，本文按照专栏的目录给你梳理一遍各个模&#x2026;
</p>
</div>
</div>


<div id="outline-container-org095ea58" class="outline-2">
<h2 id="org095ea58"><a href="https://time.geekbang.org/column/article/7623">【产品篇】推荐系统在互联网产品商业链条中的地位</a></h2>
<div class="outline-text-2" id="text-org095ea58">
<p>
一个完整的推荐系统一定是置身商业世界中，而不是只在学术界撒野，在商业世界里，就应该带一点“功利”的眼光看&#x2026;
</p>
</div>
</div>


<div id="outline-container-org4a28b8e" class="outline-2">
<h2 id="org4a28b8e"><a href="https://time.geekbang.org/column/article/7653">【产品篇】说说信息流的前世今生</a></h2>
<div class="outline-text-2" id="text-org4a28b8e">
<p>
在今天，最厉害的注意力存储器就是信息流，尤其是个性化信息流，也叫做兴趣Feed，这也是推荐系统的一种。
</p>
</div>
</div>


<div id="outline-container-org4830e0b" class="outline-2">
<h2 id="org4830e0b"><a href="https://time.geekbang.org/column/article/7657">【团队篇】组建推荐团队及工程师的学习路径</a></h2>
<div class="outline-text-2" id="text-org4830e0b">
<p>
推荐系统工程师的能力，一共有三个层次，建设起来由易到难，需要不断刻意练习才可能有较大的能力进步，这一点我&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgd0722ea" class="outline-2">
<h2 id="orgd0722ea"><a href="https://time.geekbang.org/column/article/8113">推荐系统的参考阅读</a></h2>
<div class="outline-text-2" id="text-orgd0722ea">
<p>
专栏主体内容已经结束了，在专栏写作的过程中，我阅读了很多业界公开的资料，我觉得有必要整理出来，供想要阅读&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgfdbaa86" class="outline-2">
<h2 id="orgfdbaa86"><a href="https://time.geekbang.org/column/article/8117">【尾声】遇“荐”之后，江湖再见</a></h2>
<div class="outline-text-2" id="text-orgfdbaa86">
<p>
如果要说整个写专栏过程中的一些感悟和心路，那就概括为三个“如”字吧。这三个“如”字，是三种痛苦，同时，也&#x2026;
</p>
</div>
</div>
</div>
</body>
</html>
